; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p8---int100n150-m25---int100c200---s133---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level15 level15)
(sum level0 level19 level19)
(sum level0 level22 level22)
(sum level0 level24 level24)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level15 level16)
(sum level1 level19 level20)
(sum level1 level22 level23)
(sum level1 level24 level25)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level15 level17)
(sum level2 level19 level21)
(sum level2 level22 level24)
(sum level2 level24 level26)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level15 level18)
(sum level3 level19 level22)
(sum level3 level22 level25)
(sum level3 level24 level27)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level15 level19)
(sum level4 level19 level23)
(sum level4 level22 level26)
(sum level4 level24 level28)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level15 level20)
(sum level5 level19 level24)
(sum level5 level22 level27)
(sum level5 level24 level29)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level15 level21)
(sum level6 level19 level25)
(sum level6 level22 level28)
(sum level6 level24 level30)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level15 level22)
(sum level7 level19 level26)
(sum level7 level22 level29)
(sum level7 level24 level31)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level15 level23)
(sum level8 level19 level27)
(sum level8 level22 level30)
(sum level8 level24 level32)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level15 level24)
(sum level9 level19 level28)
(sum level9 level22 level31)
(sum level9 level24 level33)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level15 level25)
(sum level10 level19 level29)
(sum level10 level22 level32)
(sum level10 level24 level34)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level15 level26)
(sum level11 level19 level30)
(sum level11 level22 level33)
(sum level11 level24 level35)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level15 level27)
(sum level12 level19 level31)
(sum level12 level22 level34)
(sum level12 level24 level36)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level15 level28)
(sum level13 level19 level32)
(sum level13 level22 level35)
(sum level13 level24 level37)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level15 level29)
(sum level14 level19 level33)
(sum level14 level22 level36)
(sum level14 level24 level38)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level15 level30)
(sum level15 level19 level34)
(sum level15 level22 level37)
(sum level15 level24 level39)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level15 level31)
(sum level16 level19 level35)
(sum level16 level22 level38)
(sum level16 level24 level40)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level15 level32)
(sum level17 level19 level36)
(sum level17 level22 level39)
(sum level17 level24 level41)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level15 level33)
(sum level18 level19 level37)
(sum level18 level22 level40)
(sum level18 level24 level42)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level15 level34)
(sum level19 level19 level38)
(sum level19 level22 level41)
(sum level19 level24 level43)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level15 level35)
(sum level20 level19 level39)
(sum level20 level22 level42)
(sum level20 level24 level44)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level15 level36)
(sum level21 level19 level40)
(sum level21 level22 level43)
(sum level21 level24 level45)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level15 level37)
(sum level22 level19 level41)
(sum level22 level22 level44)
(sum level22 level24 level46)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level15 level38)
(sum level23 level19 level42)
(sum level23 level22 level45)
(sum level23 level24 level47)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level15 level39)
(sum level24 level19 level43)
(sum level24 level22 level46)
(sum level24 level24 level48)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level15 level40)
(sum level25 level19 level44)
(sum level25 level22 level47)
(sum level25 level24 level49)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level15 level41)
(sum level26 level19 level45)
(sum level26 level22 level48)
(sum level26 level24 level50)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level15 level42)
(sum level27 level19 level46)
(sum level27 level22 level49)
(sum level27 level24 level51)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level15 level43)
(sum level28 level19 level47)
(sum level28 level22 level50)
(sum level28 level24 level52)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level15 level44)
(sum level29 level19 level48)
(sum level29 level22 level51)
(sum level29 level24 level53)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level15 level45)
(sum level30 level19 level49)
(sum level30 level22 level52)
(sum level30 level24 level54)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level15 level46)
(sum level31 level19 level50)
(sum level31 level22 level53)
(sum level31 level24 level55)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level15 level47)
(sum level32 level19 level51)
(sum level32 level22 level54)
(sum level32 level24 level56)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level15 level48)
(sum level33 level19 level52)
(sum level33 level22 level55)
(sum level33 level24 level57)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level15 level49)
(sum level34 level19 level53)
(sum level34 level22 level56)
(sum level34 level24 level58)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level15 level50)
(sum level35 level19 level54)
(sum level35 level22 level57)
(sum level35 level24 level59)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level15 level51)
(sum level36 level19 level55)
(sum level36 level22 level58)
(sum level36 level24 level60)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level15 level52)
(sum level37 level19 level56)
(sum level37 level22 level59)
(sum level37 level24 level61)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level15 level53)
(sum level38 level19 level57)
(sum level38 level22 level60)
(sum level38 level24 level62)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level15 level54)
(sum level39 level19 level58)
(sum level39 level22 level61)
(sum level39 level24 level63)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level15 level55)
(sum level40 level19 level59)
(sum level40 level22 level62)
(sum level40 level24 level64)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level15 level56)
(sum level41 level19 level60)
(sum level41 level22 level63)
(sum level41 level24 level65)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level15 level57)
(sum level42 level19 level61)
(sum level42 level22 level64)
(sum level42 level24 level66)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level15 level58)
(sum level43 level19 level62)
(sum level43 level22 level65)
(sum level43 level24 level67)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level15 level59)
(sum level44 level19 level63)
(sum level44 level22 level66)
(sum level44 level24 level68)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level15 level60)
(sum level45 level19 level64)
(sum level45 level22 level67)
(sum level45 level24 level69)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level15 level61)
(sum level46 level19 level65)
(sum level46 level22 level68)
(sum level46 level24 level70)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level15 level62)
(sum level47 level19 level66)
(sum level47 level22 level69)
(sum level47 level24 level71)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level15 level63)
(sum level48 level19 level67)
(sum level48 level22 level70)
(sum level48 level24 level72)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level15 level64)
(sum level49 level19 level68)
(sum level49 level22 level71)
(sum level49 level24 level73)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level15 level65)
(sum level50 level19 level69)
(sum level50 level22 level72)
(sum level50 level24 level74)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level15 level66)
(sum level51 level19 level70)
(sum level51 level22 level73)
(sum level51 level24 level75)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level15 level67)
(sum level52 level19 level71)
(sum level52 level22 level74)
(sum level52 level24 level76)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level15 level68)
(sum level53 level19 level72)
(sum level53 level22 level75)
(sum level53 level24 level77)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level15 level69)
(sum level54 level19 level73)
(sum level54 level22 level76)
(sum level54 level24 level78)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level15 level70)
(sum level55 level19 level74)
(sum level55 level22 level77)
(sum level55 level24 level79)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level15 level71)
(sum level56 level19 level75)
(sum level56 level22 level78)
(sum level56 level24 level80)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level57 level15 level72)
(sum level57 level19 level76)
(sum level57 level22 level79)
(sum level57 level24 level81)
(sum level58 level2 level60)
(sum level58 level3 level61)
(sum level58 level15 level73)
(sum level58 level19 level77)
(sum level58 level22 level80)
(sum level58 level24 level82)
(sum level59 level2 level61)
(sum level59 level3 level62)
(sum level59 level15 level74)
(sum level59 level19 level78)
(sum level59 level22 level81)
(sum level59 level24 level83)
(sum level60 level2 level62)
(sum level60 level3 level63)
(sum level60 level15 level75)
(sum level60 level19 level79)
(sum level60 level22 level82)
(sum level60 level24 level84)
(sum level61 level2 level63)
(sum level61 level3 level64)
(sum level61 level15 level76)
(sum level61 level19 level80)
(sum level61 level22 level83)
(sum level61 level24 level85)
(sum level62 level2 level64)
(sum level62 level3 level65)
(sum level62 level15 level77)
(sum level62 level19 level81)
(sum level62 level22 level84)
(sum level62 level24 level86)
(sum level63 level2 level65)
(sum level63 level3 level66)
(sum level63 level15 level78)
(sum level63 level19 level82)
(sum level63 level22 level85)
(sum level63 level24 level87)
(sum level64 level2 level66)
(sum level64 level3 level67)
(sum level64 level15 level79)
(sum level64 level19 level83)
(sum level64 level22 level86)
(sum level64 level24 level88)
(sum level65 level2 level67)
(sum level65 level3 level68)
(sum level65 level15 level80)
(sum level65 level19 level84)
(sum level65 level22 level87)
(sum level65 level24 level89)
(sum level66 level2 level68)
(sum level66 level3 level69)
(sum level66 level15 level81)
(sum level66 level19 level85)
(sum level66 level22 level88)
(sum level66 level24 level90)
(sum level67 level2 level69)
(sum level67 level3 level70)
(sum level67 level15 level82)
(sum level67 level19 level86)
(sum level67 level22 level89)
(sum level67 level24 level91)
(sum level68 level2 level70)
(sum level68 level3 level71)
(sum level68 level15 level83)
(sum level68 level19 level87)
(sum level68 level22 level90)
(sum level68 level24 level92)
(sum level69 level2 level71)
(sum level69 level3 level72)
(sum level69 level15 level84)
(sum level69 level19 level88)
(sum level69 level22 level91)
(sum level70 level2 level72)
(sum level70 level3 level73)
(sum level70 level15 level85)
(sum level70 level19 level89)
(sum level70 level22 level92)
(sum level71 level2 level73)
(sum level71 level3 level74)
(sum level71 level15 level86)
(sum level71 level19 level90)
(sum level72 level2 level74)
(sum level72 level3 level75)
(sum level72 level15 level87)
(sum level72 level19 level91)
(sum level73 level2 level75)
(sum level73 level3 level76)
(sum level73 level15 level88)
(sum level73 level19 level92)
(sum level74 level2 level76)
(sum level74 level3 level77)
(sum level74 level15 level89)
(sum level75 level2 level77)
(sum level75 level3 level78)
(sum level75 level15 level90)
(sum level76 level2 level78)
(sum level76 level3 level79)
(sum level76 level15 level91)
(sum level77 level2 level79)
(sum level77 level3 level80)
(sum level77 level15 level92)
(sum level78 level2 level80)
(sum level78 level3 level81)
(sum level79 level2 level81)
(sum level79 level3 level82)
(sum level80 level2 level82)
(sum level80 level3 level83)
(sum level81 level2 level83)
(sum level81 level3 level84)
(sum level82 level2 level84)
(sum level82 level3 level85)
(sum level83 level2 level85)
(sum level83 level3 level86)
(sum level84 level2 level86)
(sum level84 level3 level87)
(sum level85 level2 level87)
(sum level85 level3 level88)
(sum level86 level2 level88)
(sum level86 level3 level89)
(sum level87 level2 level89)
(sum level87 level3 level90)
(sum level88 level2 level90)
(sum level88 level3 level91)
(sum level89 level2 level91)
(sum level89 level3 level92)
(sum level90 level2 level92)

(connected l0 l2)
(fuelcost level15 l0 l2)
(connected l1 l2)
(fuelcost level22 l1 l2)
(connected l1 l3)
(fuelcost level3 l1 l3)
(connected l1 l4)
(fuelcost level3 l1 l4)
(connected l2 l0)
(fuelcost level15 l2 l0)
(connected l2 l1)
(fuelcost level22 l2 l1)
(connected l2 l3)
(fuelcost level2 l2 l3)
(connected l2 l4)
(fuelcost level19 l2 l4)
(connected l3 l1)
(fuelcost level3 l3 l1)
(connected l3 l2)
(fuelcost level2 l3 l2)
(connected l3 l4)
(fuelcost level24 l3 l4)
(connected l4 l1)
(fuelcost level3 l4 l1)
(connected l4 l2)
(fuelcost level19 l4 l2)
(connected l4 l3)
(fuelcost level24 l4 l3)

(at t0 l4)
(fuel t0 level92)
(= (total-cost) 0)

(at p0 l2)
(at p1 l2)
(at p2 l3)
(at p3 l1)
(at p4 l1)
(at p5 l4)
(at p6 l0)
(at p7 l1)
)

(:goal
(and
(at p0 l4)
(at p1 l3)
(at p2 l1)
(at p3 l2)
(at p4 l3)
(at p5 l2)
(at p6 l2)
(at p7 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p5 t0 l4)
   deleted: (at p5 l4)
   added: (in p5 t0)
   goals met: 0 of 8
2. (drive t0 l4 l1 level89 level3 level92)
   deleted: (at t0 l4) (fuel t0 level92)
   added: (at t0 l1) (fuel t0 level89)
   goals met: 0 of 8
3. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 8
4. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 8
5. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 8
6. (drive t0 l1 l2 level67 level22 level89)
   deleted: (at t0 l1) (fuel t0 level89)
   added: (at t0 l2) (fuel t0 level67)
   goals met: 0 of 8
7. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 1 of 8
8. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 2 of 8
9. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 2 of 8
10. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 2 of 8
11. (drive t0 l2 l0 level52 level15 level67)
   deleted: (at t0 l2) (fuel t0 level67)
   added: (at t0 l0) (fuel t0 level52)
   goals met: 2 of 8
12. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 2 of 8
13. (drive t0 l0 l2 level37 level15 level52)
   deleted: (at t0 l0) (fuel t0 level52)
   added: (at t0 l2) (fuel t0 level37)
   goals met: 2 of 8
14. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 3 of 8
15. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 4 of 8
16. (drive t0 l2 l3 level35 level2 level37)
   deleted: (at t0 l2) (fuel t0 level37)
   added: (at t0 l3) (fuel t0 level35)
   goals met: 4 of 8
17. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 4 of 8
18. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 5 of 8
19. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 6 of 8
20. (drive t0 l3 l1 level32 level3 level35)
   deleted: (at t0 l3) (fuel t0 level35)
   added: (at t0 l1) (fuel t0 level32)
   goals met: 6 of 8
21. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 7 of 8
22. (drive t0 l1 l4 level29 level3 level32)
   deleted: (at t0 l1) (fuel t0 level32)
   added: (at t0 l4) (fuel t0 level29)
   goals met: 7 of 8
23. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 8 of 8
